In [1]:
import pandas as pd

In [2]:
population = pd.Series([3333343, 12341324, 5457456,98098])
# Series 는 인덱스를 같이 출력??
population

0     3333343
1    12341324
2     5457456
3       98098
dtype: int64

In [6]:
population = pd.Series([3333343, 12341324, 5457456,98098], 
                       index = ["seoul", "busan", "deagu", "jeju"])
population

seoul     3333343
busan    12341324
deagu     5457456
jeju        98098
dtype: int64

In [10]:
population.values

array([ 3333343, 12341324,  5457456,    98098], dtype=int64)

In [11]:
population.index

Index(['seoul', 'busan', 'deagu', 'jeju'], dtype='object')

In [12]:
population.dtype

dtype('int64')

In [14]:
population.name = "Population"
population.index.name = "City"
population

City
seoul     3333343
busan    12341324
deagu     5457456
jeju        98098
Name: Population, dtype: int64

In [15]:
population/1000000

City
seoul     3.333343
busan    12.341324
deagu     5.457456
jeju      0.098098
Name: Population, dtype: float64

In [16]:
population[1], population["busan"]

(12341324, 12341324)

In [17]:
population[3], population["jeju"]

(98098, 98098)

In [23]:
population[[0,3,1]], population[["seoul","jeju","busan"]]

(City
 seoul     3333343
 jeju        98098
 busan    12341324
 Name: Population, dtype: int64,
 City
 seoul     3333343
 jeju        98098
 busan    12341324
 Name: Population, dtype: int64)

In [24]:
population >= 300000

City
seoul     True
busan     True
deagu     True
jeju     False
Name: Population, dtype: bool

In [25]:
population[population >= 300000]
# 음......??

City
seoul     3333343
busan    12341324
deagu     5457456
Name: Population, dtype: int64

In [28]:
population[(population >= 250000) & (population <= 5000000)]

City
seoul    3333343
Name: Population, dtype: int64

In [31]:
population[1:3], population['seoul':'jeju']

(City
 busan    12341324
 deagu     5457456
 Name: Population, dtype: int64,
 City
 seoul     3333343
 busan    12341324
 deagu     5457456
 jeju        98098
 Name: Population, dtype: int64)

In [32]:
data = {'피카츄':9631, '꼬부기':3393, '파이리':1490,'이상해씨':2632}
poketmon = pd.Series(data)
poketmon

피카츄     9631
꼬부기     3393
파이리     1490
이상해씨    2632
dtype: int64

In [33]:
data2 = {'피카츄':9904, '꼬부기':3448, '뮤':2466,'이브이':2890}
poketmon_up = pd.Series(data2)
poketmon_up

피카츄    9904
꼬부기    3448
뮤      2466
이브이    2890
dtype: int64

In [35]:
attack = poketmon_up - poketmon
attack
# NaN = not a number

꼬부기      55.0
뮤         NaN
이브이       NaN
이상해씨      NaN
파이리       NaN
피카츄     273.0
dtype: float64

In [36]:
attack.notnull()

꼬부기      True
뮤       False
이브이     False
이상해씨    False
파이리     False
피카츄      True
dtype: bool

In [42]:
print(attack[attack.notnull()])

꼬부기     55.0
피카츄    273.0
dtype: float64

In [43]:
print(attack[attack.isnull()])
# null 만 보고 싶을 때 "isnull"

뮤      NaN
이브이    NaN
이상해씨   NaN
파이리    NaN
dtype: float64

In [45]:
attack[attack.isnull['뮤':'이상해씨']]

TypeError: 'method' object is not subscriptable

In [51]:
rp = (poketmon_up - poketmon)/poketmon *100
rp

꼬부기     1.620984
뮤            NaN
이브이          NaN
이상해씨         NaN
파이리          NaN
피카츄     2.834597
dtype: float64

In [52]:
rp[rp.notnull()]

꼬부기    1.620984
피카츄    2.834597
dtype: float64

In [53]:
attack

꼬부기      55.0
뮤         NaN
이브이       NaN
이상해씨      NaN
파이리       NaN
피카츄     273.0
dtype: float64

In [54]:
attack['파이리'] = 1616
attack['리자몽'] = 8888
del attack['이상해씨']

In [55]:
attack

꼬부기      55.0
뮤         NaN
이브이       NaN
파이리    1616.0
피카츄     273.0
리자몽    8888.0
dtype: float64

In [62]:
data = {'2020':[9668465,3319564,4654654,1564562],
       '2010':[45645612,45645645,78978948,789789,]
       }
df = pd.DataFrame(data)

df.index = ["seoul", "busan", "deagu", "jeju"]
df

          2020      2010
seoul  9668465  45645612
busan  3319564  45645645
deagu  4654654  78978948
jeju   1564562    789789

In [86]:
data = {'2020':[9668465,3319564,4654654,1564562],
       '2010':[45645612,45645645,78978948,789789,]
       }
df = pd.DataFrame(data,index = ["seoul", "busan", "deagu", "jeju"])
# 오류: data와 index 사이에 점이 아니라 콤마였다..왜??
df

          2020      2010
seoul  9668465  45645612
busan  3319564  45645645
deagu  4654654  78978948
jeju   1564562    789789

In [67]:
data2 = [[9668465,3319564,4654654,1564562],
         [45645612,45645645,78978948,789789,]]
ind = ['2020','2010']
# 인덱스 설정
col = ["seoul", "busan", "deagu", "jeju"]
# 칼럼 설정
df2 = pd.DataFrame(data2, index = ind, columns = col)
df2

         seoul     busan     deagu     jeju
2020   9668465   3319564   4654654  1564562
2010  45645612  45645645  78978948   789789

In [69]:
df2.T
# 데이터프레임 전치하기(Transform)

          2020      2010
seoul  9668465  45645612
busan  3319564  45645645
deagu  4654654  78978948
jeju   1564562    789789

In [71]:
df.values

array([[ 9668465, 45645612],
       [ 3319564, 45645645],
       [ 4654654, 78978948],
       [ 1564562,   789789]], dtype=int64)

In [72]:
df.index

Index(['seoul', 'busan', 'deagu', 'jeju'], dtype='object')

In [73]:
df.columns

Index(['2020', '2010'], dtype='object')

In [79]:
df

          2020      2010
seoul  9668465  45645612
busan  3319564  45645645
deagu  4654654  78978948
jeju   1564562    789789

In [87]:
df['2020']
# dimension one

seoul    9668465
busan    3319564
deagu    4654654
jeju     1564562
Name: 2020, dtype: int64

In [88]:
df[['2020']]
# dimension two

          2020
seoul  9668465
busan  3319564
deagu  4654654
jeju   1564562

In [99]:
df[['2020','2010']]

          2020      2010
seoul  9668465  45645612
busan  3319564  45645645
deagu  4654654  78978948
jeju   1564562    789789

In [96]:
df['2005'] = [5464654,4654542,6513152,4612613]
df

          2020      2010     2005
seoul  9668465  45645612  5464654
busan  3319564  45645645  4654542
deagu  4654654  78978948  6513152
jeju   1564562    789789  4612613

In [97]:
df[0:2]

          2020      2010     2005
seoul  9668465  45645612  5464654
busan  3319564  45645645  4654542

In [98]:
df['seoul':'deagu']
# 문자열은 이상, 이하 개념이 없다.

          2020      2010     2005
seoul  9668465  45645612  5464654
busan  3319564  45645645  4654542
deagu  4654654  78978948  6513152

In [100]:
df.loc['busan':'deagu','2020':'2010']

          2020      2010
busan  3319564  45645645
deagu  4654654  78978948

In [102]:
df.loc['busan':'deagu','2020':]

          2020      2010     2005
busan  3319564  45645645  4654542
deagu  4654654  78978948  6513152

In [104]:
df.iloc[3]

2020    1564562
2010     789789
2005    4612613
Name: jeju, dtype: int64

In [105]:
df['2020'] >= 2500000

seoul     True
busan     True
deagu     True
jeju     False
Name: 2020, dtype: bool

In [107]:
df[df['2010'] >= 2500000]

          2020      2010     2005
seoul  9668465  45645612  5464654
busan  3319564  45645645  4654542
deagu  4654654  78978948  6513152

In [123]:
population = pd.read_csv('Population - 시트1.csv', encoding = 'utf-8')
population
# 오류: 파일 이름 틀렸다.
# utf로 바꾸니까 iport됐다.

   도시   지역     2015       2010        2005      2000
0  서울  수도권  9904312  9631482.0  99762546.0  98853972
1  부산  경상권  3448737        NaN         NaN   3655437
2  인천  수도권  2890451  2632035.0         NaN   2466338
3  대구  경상권  2466052  2431774.0   2456016.0   2473990

In [124]:
population = pd.read_csv('Population - 시트1.csv', index_col = '도시', encoding = 'utf-8')
population

     지역     2015       2010        2005      2000
도시
서울  수도권  9904312  9631482.0  99762546.0  98853972
부산  경상권  3448737        NaN         NaN   3655437
인천  수도권  2890451  2632035.0         NaN   2466338
대구  경상권  2466052  2431774.0   2456016.0   2473990

In [125]:
population.sort_index()

     지역     2015       2010        2005      2000
도시
대구  경상권  2466052  2431774.0   2456016.0   2473990
부산  경상권  3448737        NaN         NaN   3655437
서울  수도권  9904312  9631482.0  99762546.0  98853972
인천  수도권  2890451  2632035.0         NaN   2466338

In [126]:
population['2010'].sort_values()

도시
대구    2431774.0
인천    2632035.0
서울    9631482.0
부산          NaN
Name: 2010, dtype: float64

In [127]:
population.sort_values(by = '2010')

     지역     2015       2010        2005      2000
도시
대구  경상권  2466052  2431774.0   2456016.0   2473990
인천  수도권  2890451  2632035.0         NaN   2466338
서울  수도권  9904312  9631482.0  99762546.0  98853972
부산  경상권  3448737        NaN         NaN   3655437

In [129]:
population.sort_values(by = ['지역','2010'])

     지역     2015       2010        2005      2000
도시
대구  경상권  2466052  2431774.0   2456016.0   2473990
부산  경상권  3448737        NaN         NaN   3655437
인천  수도권  2890451  2632035.0         NaN   2466338
서울  수도권  9904312  9631482.0  99762546.0  98853972

In [135]:
score = pd.read_csv('score - 시트2.csv', encoding = 'utf-8')
score

# population = pd.read_csv('Population - 시트1.csv', encoding = 'utf-8')
# population

    과목  1반  2반  3반  4반
0  파이썬  45  44  73  39
1   DB  76  92  45  69
2   자바  47  92  45  69
3  크롤링  92  81  85  40
4  Web  11  79  47  26

In [139]:
score = pd.read_csv('score - 시트2.csv', index_col = '과목', encoding = 'utf-8')
score

     1반  2반  3반  4반
과목
파이썬  45  44  73  39
DB   76  92  45  69
자바   47  92  45  69
크롤링  92  81  85  40
Web  11  79  47  26

In [140]:
score.sort_index()
# 인덱스 기준 정렬

     1반  2반  3반  4반
과목
DB   76  92  45  69
Web  11  79  47  26
자바   47  92  45  69
크롤링  92  81  85  40
파이썬  45  44  73  39

In [141]:
score.sum()

1반    271
2반    388
3반    295
4반    243
dtype: int64

In [142]:
score.sum().sort_values(ascending = False)
# 값 기준 정렬

2반    388
3반    295
1반    271
4반    243
dtype: int64

In [143]:
score.sum(axis = 1)
# 행: axis = 1
# 열: axis = 0

과목
파이썬    201
DB     282
자바     253
크롤링    298
Web    163
dtype: int64

In [144]:
score.sum(axis = 0)

1반    271
2반    388
3반    295
4반    243
dtype: int64